Конфигурация/Documents/ПогашениеЦеннойБумаги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПогашениеЦеннойБумаги</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумагЗаблокированные</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагПроданныеВРепо</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиПогашаемые</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПогашения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПогашения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыПИФ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УправляющиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеФонда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/РынкиЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>РынкиЦенныхБумаг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Векселя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закладные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИпотечныеСертификатыУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарныеРасписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фьючерсы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опционы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВалютныеПары</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДрагоценныеМеталлы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/МетодыОпределенияДоходовИРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>МетодыОпределенияДоходовИРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВариантыОтраженияДоходаАммортизационныхОблигаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВариантыОтраженияДоходаАммортизационныхОблигаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриПолномПогашении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриЧастичномПогашении</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПогашениеЦеннойБумаги/Ext/ManagerModule.bsl
Процедура ПроведениеПоРегиструБухгалтерииСписаниеПаев(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь)

	ЭтотОбъект 				= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ЦеннаяБумага, Сумма, ВалютаОплаты, Количество");
	ВалютаУчета 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыПИФСрезПоследних.УправляющаяКомпания.ЮрФизЛицо КАК УправляющаяКомпанияЮрФизЛицо
	|ИЗ
	|	РегистрСведений.РеквизитыПИФ.СрезПоследних(&Период, ПаевойИнвестиционныйФонд = &ПаевойИнвестиционныйФонд) КАК РеквизитыПИФСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ПаевойИнвестиционныйФонд", ЭтотОбъект.ЦеннаяБумага.ПаевойИнвестиционныйФонд);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЮрЛицоЭмитента = ВыборкаДетальныеЗаписи.УправляющаяКомпанияЮрФизЛицо;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. не определен контрагент",,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ОбращаетсяНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦеннойБумагиНаОРЦБ(Дата, ЭтотОбъект.ЦеннаяБумага, УчетныйРегистр);	
	
	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Перечисления.РынкиЦенныхБумаг.Паи, ЭтотОбъект.ЦеннаяБумага);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);		
		
	СчетДоходов  = ПланыСчетов.Основной.ПрочиеДоходы;	
	СчетРасходов = ПланыСчетов.Основной.ПрочиеРасходы;
		
	ИспользоватьСчетПродаж = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		Дата,
		Организация, 
		СчетДоверительногоУправления,
		"ИспользоватьСчетПродаж");
		
	Если ИспользоватьСчетПродаж Тогда
		СчетДоходов  = ПланыСчетов.Основной.Выручка;
		СчетРасходов = ПланыСчетов.Основной.СебестоимостьПродажи;
	КонецЕсли;	
		
	//читаем движения партий
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.Стоимость = 0
		|				И БухПартииЦенныхБумаг.Переоценка = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Перекурсовка
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.Стоимость = 0
		|				И БухПартииЦенныхБумаг.Переоценка = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";

	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	СтруктураОбъекта = Новый Структура("Ссылка, Дата, Движения", ДокументСсылка, Дата, Движения); 
	
	Стоимость  				= 0;
	СтоимостьВВалютеУчета  	= 0;
	Переоценка 				= 0;
	ПереоценкаВВалютеУчета 	= 0;
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы",,,, Отказ);
		Возврат;
		
	КонецЕсли;
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Перекурсовка Тогда
			
			ПараметрыПерекурсовки = Новый Структура(
				"ЦеннаяБумага, Рынок, СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета",
				ЭтотОбъект.ЦеннаяБумага, Перечисления.РынкиЦенныхБумаг.Паи,	ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета, 0, ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета, 0);
				
			СчетаУчета = Новый Структура;
			СчетаУчета.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчета);
			
			СчетаУчетаПереоценки = Новый Структура;
			СчетаУчетаПереоценки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчетаПереоценки);
			
			АналитикаПерекурсовки = Новый Структура;
			АналитикаПерекурсовки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.АналитикаПерекурсовки);
			
			БухгалтерскийУчет.ДвижениеПерекурсовки(СтруктураОбъекта, УчетныйРегистр, ПараметрыПерекурсовки, АналитикаПерекурсовки,  СчетаУчета, СчетаУчетаПереоценки, ОбращаетсяНаОРЦБ, Отказ);		
			
		Иначе
			
			Стоимость  				= ВыборкаДетальныеЗаписи.Стоимость;
			СтоимостьВВалютеУчета  	= ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
			Переоценка 				= ВыборкаДетальныеЗаписи.Переоценка;
			ПереоценкаВВалютеУчета 	= ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Если ЭтотОбъект.ВалютаОплаты = ВалютаУчета Тогда
		РасчетыСДебиторамиИКредиторами = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях;
	Иначе
		РасчетыСДебиторамиИКредиторами = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;
	КонецЕсли;
	
	СчетУчета = НастройкиУчета.СчетУчета;
		
	СчетУчетаПереоценки = НастройкиУчета.СчетУчетаПереоценки;
		
	АналитикаДоходов = НастройкиУчета.АналитикаДоходов;		
	
	ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЦеннаяБумага, "ВалютаНоминала");
	ВалютныйУчет = ВалютаНоминала <> ВалютаУчета;
		
	//Дт Счет7651 Кт СчетДоходы Сумма = ЭтотОбъект.ПогашениеЦеннойБумаги.Сумма
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.ВалютаОплаты, Организация, Дата, Отказ) , "Доход от погашения паев");
	
	Проводка.СчетДт = РасчетыСДебиторамиИКредиторами;
	Проводка.СубконтоДт.Контрагенты = ЮрЛицоЭмитента;
	
	Если РасчетыСДебиторамиИКредиторами.Валютный Тогда
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		Проводка.ВалютаДт = ЭтотОбъект.ВалютаОплаты;
	КонецЕсли;
	
	Проводка.СчетКт = СчетДоходов;
	Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаДоходов;
	Проводка.СубконтоКт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
	Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
	
	//Дт СчетРасходы Кт СчетУчета Сумма = Стоимость
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтоимостьВВалютеУчета, "Себестоимость в расход");
	
	Проводка.СчетДт = СчетРасходов;
	Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходов;
	Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
	Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
	
	Проводка.СчетКт = СчетУчета;
	Проводка.СубконтоКт.Паи = ЭтотОбъект.ЦеннаяБумага;
	
	Проводка.КоличествоКт = ЭтотОбъект.Количество;
	
	Если ВалютныйУчет Тогда
		Проводка.ВалютнаяСуммаКт = Стоимость;
		Проводка.ВалютаКт = ВалютаНоминала;
	КонецЕсли;
	
	//Если СчетУчета <> СчетУчетаПереоценки Тогда
		//Дт СчетРасходы Кт СчетУчетаПереоценки = Переоценка
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ПереоценкаВВалютеУчета, "Переоценка в расход");
		
		Проводка.СчетДт = СчетРасходов;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходов;
		Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		
		Проводка.СчетКт = СчетУчетаПереоценки;
		Проводка.СубконтоКт.Паи = ЭтотОбъект.ЦеннаяБумага;
		
		Если ВалютныйУчет Тогда
			Проводка.ВалютнаяСуммаКт = Переоценка;
			Проводка.ВалютаКт = ВалютаНоминала;
		КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерииСписаниеЦенныхБумаг(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь)

	ЭтотОбъект 				= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ЦеннаяБумага, Сумма, ВалютаОплаты, Количество, Рынок");
	ВалютаУчета 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета");
	
	ОбращаетсяНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦеннойБумагиНаОРЦБ(Дата, ЭтотОбъект.ЦеннаяБумага, УчетныйРегистр);	
	
	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, ЭтотОбъект.Рынок, ЭтотОбъект.ЦеннаяБумага);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);		
		
	СчетДоходов  = ПланыСчетов.Основной.ПрочиеДоходы;	
	СчетРасходов = ПланыСчетов.Основной.ПрочиеРасходы;
		
	ИспользоватьСчетПродаж = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		Дата,
		Организация, 
		СчетДоверительногоУправления,
		"ИспользоватьСчетПродаж");
		
	Если ИспользоватьСчетПродаж Тогда
		СчетДоходов  = ПланыСчетов.Основной.Выручка;
		СчетРасходов = ПланыСчетов.Основной.СебестоимостьПродажи;
	КонецЕсли;	
	
	ВидСубконтоУчетаЦеннойБумаги = БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(ЭтотОбъект.Рынок);	
		
	//читаем движения партий
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.Стоимость = 0
		|				И БухПартииЦенныхБумаг.Переоценка = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Перекурсовка
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.Стоимость = 0
		|				И БухПартииЦенныхБумаг.Переоценка = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";

	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();

	СтруктураОбъекта = Новый Структура("Ссылка, Дата, Движения", ДокументСсылка, Дата, Движения); 
	
	Стоимость  				= 0;
	СтоимостьВВалютеУчета  	= 0;
	Переоценка 				= 0;
	ПереоценкаВВалютеУчета 	= 0;
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы",,,, Отказ);
		Возврат;
		
	КонецЕсли;
		
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Перекурсовка Тогда
			
			ПараметрыПерекурсовки = Новый Структура(
				"ЦеннаяБумага, Рынок, СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета",
				ЭтотОбъект.ЦеннаяБумага, ЭтотОбъект.Рынок,	ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета, 0, ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета, 0);
				
			СчетаУчета = Новый Структура;
			СчетаУчета.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчета);
			
			СчетаУчетаПереоценки = Новый Структура;
			СчетаУчетаПереоценки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчетаПереоценки);
			
			АналитикаПерекурсовки = Новый Структура;
			АналитикаПерекурсовки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.АналитикаПерекурсовки);
			
			БухгалтерскийУчет.ДвижениеПерекурсовки(СтруктураОбъекта, УчетныйРегистр, ПараметрыПерекурсовки, АналитикаПерекурсовки,  СчетаУчета, СчетаУчетаПереоценки, ОбращаетсяНаОРЦБ, Отказ);		
			
		Иначе
			
			Стоимость  				= ВыборкаДетальныеЗаписи.Стоимость;
			СтоимостьВВалютеУчета  	= ВыборкаДетальныеЗаписи.СтоимостьВВалютеУчета;
			Переоценка 				= ВыборкаДетальныеЗаписи.Переоценка;
			ПереоценкаВВалютеУчета 	= ВыборкаДетальныеЗаписи.ПереоценкаВВалютеУчета;
			
		КонецЕсли;
		
	КонецЦикла;
		
	Если ЭтотОбъект.ВалютаОплаты = ВалютаУчета Тогда
		РасчетыСДебиторамиИКредиторами = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях;
	Иначе
		РасчетыСДебиторамиИКредиторами = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;
	КонецЕсли;
	
	СчетУчета = НастройкиУчета.СчетУчета;
		
	СчетУчетаПереоценки = НастройкиУчета.СчетУчетаПереоценки;
		
	АналитикаДоходов = НастройкиУчета.АналитикаДоходовПоследнееПогашение;		
	
	ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЦеннаяБумага, "ВалютаНоминала");
		
	//Дт Счет7651 Кт СчетДоходы Сумма = ЭтотОбъект.ПогашениеЦеннойБумаги.Сумма
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ЭтотОбъект.ВалютаОплаты, Организация, Дата, Отказ) , "Доход от погашения");
	
	Проводка.СчетДт = РасчетыСДебиторамиИКредиторами;
	Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
	
	Если РасчетыСДебиторамиИКредиторами.Валютный Тогда
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		Проводка.ВалютаДт = ЭтотОбъект.ВалютаОплаты;
	КонецЕсли;
	
	Проводка.СчетКт = СчетДоходов;
	Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаДоходов;
	Проводка.СубконтоКт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
	Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
	
	//Дт СчетРасходы Кт СчетУчета Сумма = Стоимость
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтоимостьВВалютеУчета, "Себестоимость в расход");
	
	Проводка.СчетДт = СчетРасходов;
	Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходов;
	Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
	Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
	
	Проводка.СчетКт = СчетУчета;
	Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ЭтотОбъект.ЦеннаяБумага;
	
	// количество списывается ТОЛЬКО в списании
	Проводка.КоличествоКт = 0;
	
	Если СчетУчета.Валютный Тогда
		Проводка.ВалютнаяСуммаКт = Стоимость;
		Проводка.ВалютаКт = ВалютаНоминала;
	КонецЕсли;
	
	Если Переоценка <> 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ПереоценкаВВалютеУчета, "Переоценка в расход");
		
		Проводка.СчетДт = СчетРасходов;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходов;
		Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		
		Проводка.СчетКт = СчетУчетаПереоценки;
		Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ЭтотОбъект.ЦеннаяБумага;
		
		Если СчетУчетаПереоценки.Валютный Тогда
			Проводка.ВалютнаяСуммаКт = Переоценка;
			Проводка.ВалютаКт = ВалютаНоминала;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПодготовитьНаборПроводок(ДокументСсылка, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности = Неопределено, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь) Экспорт
	
	Движения = РегистрыБухгалтерии[УчетныйРегистр].СоздатьНаборЗаписей();
	
	Если Не ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПогашениеЦеннойБумаги") Тогда
		Возврат Движения;
	КонецЕсли;
	
	ЭтотОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ЦеннаяБумага, Рынок, ВалютаОплаты, Сумма");
	
	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, ЭтотОбъект.Рынок, ЭтотОбъект.ЦеннаяБумага);
	
	ВариантОтраженияДебиторскойЗадолженностиПриПолномПогашении = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр,
		"ВариантОтраженияДебиторскойЗадолженностиПриПолномПогашении");
	
	Если ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Паи Тогда
		
		Если ВариантОтраженияДебиторскойЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментПогашения Тогда
			ПроведениеПоРегиструБухгалтерииСписаниеПаев(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, УчетныйРегистр, Отказ);
		КонецЕсли;
		
		Возврат Движения;
		
	ИначеЕсли ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия
		ИЛИ ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Векселя Тогда
		
		Если ВариантОтраженияДебиторскойЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментПогашения Тогда
			ПроведениеПоРегиструБухгалтерииСписаниеЦенныхБумаг(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, УчетныйРегистр, Отказ);
		КонецЕсли;
		
		Возврат Движения;
		
	КонецЕсли;
	
	МетодОпределенияДоходовИРасходов = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(
		Дата, 
		Организация, 
		СчетДоверительногоУправления,
		УчетныйРегистр,
		"МетодОпределенияДоходовИРасходов");
		
	Если Не ЗначениеЗаполнено(МетодОпределенияДоходовИРасходов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В настройках по виду учета " + УчетныйРегистр + " не указан метод определения доходов и расходов. Документ не проведен по виду учета!", ДокументСсылка,,,Отказ);
		Возврат Движения;
	КонецЕсли;
	
	Если МетодОпределенияДоходовИРасходов = Перечисления.МетодыОпределенияДоходовИРасходов.Кассовый
		И ЭтоПроведениеНачисления Тогда // при кассовом методе в любом случае возвращаем пустые движения
		Возврат Движения;
	КонецЕсли;

	ЭтотОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ЦеннаяБумага, ВидПогашения");
	
	Если ЭтотОбъект.ВидПогашения = Перечисления.ВидыПогашения.ЧастичноеПогашение Тогда
		ПроведениеПоРегиструБухгалтерииЧастичноеПогашение(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь);
		
	Иначе
			
		Если ВидЗадолженности = Неопределено Или ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона Тогда	
			ПроведениеПоРегиструБухгалтерииПогашениеКупона(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления);
		КонецЕсли;	
		
		Если ВидЗадолженности = Неопределено Или ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации Тогда
			Если ВариантОтраженияДебиторскойЗадолженностиПриПолномПогашении = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментПогашения Тогда
				ПроведениеПоРегиструБухгалтерииПолноеПогашение(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления);
			Иначе
				ПроведениеПоРегиструБухгалтерииПолноеПогашение(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления, Истина);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Движения;
	
КонецФункции	

Процедура ПроведениеПоРегиструБухгалтерииЧастичноеПогашение(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности = Неопределено, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь)

	ЭтотОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ЦеннаяБумага, Рынок, ВалютаОплаты, Сумма");
	ЦеннаяБумага = ЭтотОбъект.ЦеннаяБумага;
	ВалютаОплаты = ЭтотОбъект.ВалютаОплаты;
	
	ОбращаетсяНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦеннойБумагиНаОРЦБ(Дата, ЭтотОбъект.ЦеннаяБумага, УчетныйРегистр);
	
	ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.ЦеннаяБумага, "ВалютаНоминала");
	ВалютныйУчет = ВалютаНоминала <> Организация.ВалютаУчета;
	
	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Перечисления.РынкиЦенныхБумаг.Облигации, ЭтотОбъект.ЦеннаяБумага);
	УчетныйАктивКупон = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, Перечисления.РынкиЦенныхБумаг.Облигации, ЭтотОбъект.ЦеннаяБумага, Истина);
	
	ВидСубконтоУчетаЦеннойБумаги = БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(ЭтотОбъект.Рынок);	

	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);
		
	НастройкиУчетаКупона = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктивКупон,
		УчетныйРегистр);

	// читаем движения партий
	// В налоговом учете перекурсовок нет, для проводок используем суммы списания по партиям
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.СуммаЧастичногоПогашения) КАК СуммаЧастичногоПогашения,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА &ВидУчета = &ВидУчетаНалоговый
		|			ТОГДА ЛОЖЬ
		|		КОГДА БухПартииЦенныхБумаг.Стоимость = 0
		|				И БухПартииЦенныхБумаг.Переоценка = 0
		|				И БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумаг.СуммаЧастичногоПогашения = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Перекурсовка,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И БухПартииЦенныхБумаг.Количество = 0
		|				И (БухПартииЦенныхБумаг.Переоценка <> 0
		|					ИЛИ БухПартииЦенныхБумаг.Стоимость <> 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Дооценка
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА &ВидУчета = &ВидУчетаНалоговый
		|			ТОГДА ЛОЖЬ
		|		КОГДА БухПартииЦенныхБумаг.Стоимость = 0
		|				И БухПартииЦенныхБумаг.Переоценка = 0
		|				И БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумаг.СуммаЧастичногоПогашения = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И БухПартииЦенныхБумаг.Количество = 0
		|				И (БухПартииЦенныхБумаг.Переоценка <> 0
		|					ИЛИ БухПартииЦенныхБумаг.Стоимость <> 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";

	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("ВидУчетаНалоговый",    Перечисления.ВидыУчета.НалоговыйУчет);

	СтруктураОбъекта = Новый Структура("Ссылка, Дата, Движения", ДокументСсылка, Дата, Движения);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество()>0 Тогда
		Пока Выборка.Следующий() Цикл
			Если Выборка.Перекурсовка Тогда
				
				ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, Рынок,"
					+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета",
					ЦеннаяБумага, ЭтотОбъект.Рынок,
					Выборка.СтоимостьВВалютеУчета, Выборка.СтоимостьКупонаВВалютеУчета, Выборка.ПереоценкаВВалютеУчета, Выборка.ПереоценкаКупонаВВалютеУчета);
					
				СчетаУчета = Новый Структура;
				СчетаУчета.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчета);
				СчетаУчета.Вставить(УчетныйАктивКупон.ИмяПредопределенныхДанных, НастройкиУчетаКупона.СчетУчета);
				
				СчетаУчетаПереоценки = Новый Структура;
				СчетаУчетаПереоценки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчетаПереоценки);
				СчетаУчетаПереоценки.Вставить(УчетныйАктивКупон.ИмяПредопределенныхДанных, НастройкиУчетаКупона.СчетУчетаПереоценки);
				
				АналитикаПерекурсовки = Новый Структура;
				АналитикаПерекурсовки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.АналитикаПерекурсовки);
				АналитикаПерекурсовки.Вставить(УчетныйАктивКупон.ИмяПредопределенныхДанных, НастройкиУчетаКупона.АналитикаПерекурсовки);
				
				БухгалтерскийУчет.ДвижениеПерекурсовки(СтруктураОбъекта, УчетныйРегистр, ПараметрыПерекурсовки, АналитикаПерекурсовки,  СчетаУчета, СчетаУчетаПереоценки, ОбращаетсяНаОРЦБ, Отказ);		
				
			ИначеЕсли Выборка.Дооценка Тогда
				
				Если Выборка.СтоимостьВВалютеУчета > 0 Тогда
					// доначислим переоценку перед продажей
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Выборка.СтоимостьВВалютеУчета, "Переоценка ценной бумаги");
					
					Проводка.СчетДт = НастройкиУчета.СчетУчета;
					Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
					
					Если ВалютныйУчет Тогда
						Проводка.ВалютнаяСуммаДт = Выборка.Стоимость;
						Проводка.ВалютаДт = ВалютаНоминала;
					КонецЕсли;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
					Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
					Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
					Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
					
				ИначеЕсли Выборка.СтоимостьВВалютеУчета < 0 Тогда
					// доначислим переоценку перед продажей
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, -Выборка.СтоимостьВВалютеУчета, "Переоценка ценной бумаги");
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
					
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
					Проводка.СубконтоДт.ЦенныеБумаги         = ЦеннаяБумага;
					Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
					
					
					Проводка.СчетКт = НастройкиУчета.СчетУчета;
					Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
					
					Если ВалютныйУчет Тогда
						Проводка.ВалютнаяСуммаКт = -Выборка.Стоимость;
						Проводка.ВалютаКт = ВалютаНоминала;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Выборка.ПереоценкаВВалютеУчета > 0 Тогда
					// доначислим переоценку перед продажей
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Выборка.ПереоценкаВВалютеУчета, "Переоценка ценной бумаги");
					
					Проводка.СчетДт = НастройкиУчета.СчетУчетаПереоценки;
					Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
					
					Если ВалютныйУчет Тогда
						Проводка.ВалютнаяСуммаДт = Выборка.Переоценка;
						Проводка.ВалютаДт = ВалютаНоминала;
					КонецЕсли;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
					Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
					Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
					Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
					
				ИначеЕсли Выборка.ПереоценкаВВалютеУчета < 0 Тогда
					// доначислим переоценку перед продажей
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, -Выборка.ПереоценкаВВалютеУчета, "Переоценка ценной бумаги");
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
					
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
					Проводка.СубконтоДт.ЦенныеБумаги         = ЦеннаяБумага;
					Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
					
					
					Проводка.СчетКт = НастройкиУчета.СчетУчетаПереоценки;
					Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
					
					Если ВалютныйУчет Тогда
						Проводка.ВалютнаяСуммаКт = -Выборка.Переоценка;
						Проводка.ВалютаКт = ВалютаНоминала;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Стоимость                	= Выборка.Стоимость;
				СтоимостьВВалютеУчета    	= Выборка.СтоимостьВВалютеУчета;
				Переоценка               	= Выборка.Переоценка;
				ПереоценкаВВалютеУчета   	= Выборка.ПереоценкаВВалютеУчета;
				СтоимостьКупона          	= Выборка.СтоимостьКупона;
				СтоимостьКупонаВВалютеУчета = Выборка.СтоимостьКупонаВВалютеУчета;
				СуммаЧастичногоПогашения 	= Выборка.СуммаЧастичногоПогашения;
				
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение по регистрам бухгалтерии не возможно, т.к. движения по партиям не сформированы", ДокументСсылка,,, Отказ);
		Возврат;
	КонецЕсли;
	
	Счет7656 = ПланыСчетов.Основной.АвансыПоЧастичномуПогашениюОблигаций;
	
	СчетУчета = НастройкиУчета.СчетУчета;
		
	СчетУчетаПереоценки = НастройкиУчета.СчетУчетаПереоценки;
		
	АналитикаДоходов = НастройкиУчета.АналитикаДоходов;		
		
	НастройкиПоВидуУчета = БухгалтерскийУчет.ОпределитьНастройкиПоВидуУчета(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйРегистр,
		Отказ);
		
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Отсутствуют настройки у %1 по виду учета %2 на %3!", СчетДоверительногоУправления, УчетныйРегистр, Дата));
		Возврат;
	КонецЕсли;
	
	СчетДоходов  = ПланыСчетов.Основной.ПрочиеДоходы;	
	СчетРасходов = ПланыСчетов.Основной.ПрочиеРасходы;
		
	ИспользоватьСчетПродаж = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		Дата,
		Организация, 
		СчетДоверительногоУправления,
		"ИспользоватьСчетПродаж");
		
	Если ИспользоватьСчетПродаж Тогда
		СчетДоходов  = ПланыСчетов.Основной.Выручка;
		СчетРасходов = ПланыСчетов.Основной.СебестоимостьПродажи;
	КонецЕсли;	
		
		
	СчетУчетаКупон = НастройкиУчетаКупона.СчетУчета;
		
	АналитикаДоходовКупон = НастройкиУчетаКупона.АналитикаДоходов;		
		
	АналитикаДоходовПоследнееПогашение = НастройкиУчетаКупона.АналитикаДоходовПоследнееПогашение;		
		
	Если НастройкиУчета.ОтражениеДоходаАммортизационныхОблигаций = Перечисления.ВариантыОтраженияДоходаАммортизационныхОблигаций.ПриЧастичномПогашении
		 И СуммаЧастичногоПогашения = 0
	Тогда
	
		//Дт Счет7656 Кт СчетДоходы Сумма = ЭтотОбъект.СуммаКупона
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма,ВалютаОплаты,Организация, Дата, Отказ), "Доход от погашения облигации");
		
		Проводка.СчетДт = Счет7656;
		Проводка.СубконтоДт.Облигации = ЭтотОбъект.ЦеннаяБумага;
		
		Проводка.СчетКт = СчетДоходов;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаДоходов;
		Проводка.СубконтоКт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
		Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		
		//Дт СчетРасходы Кт СчетУчета Сумма = Стоимость
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтоимостьВВалютеУчета, "Себестоимость в расход");
		
		Проводка.СчетДт = СчетРасходов;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходов;
		Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		
		Проводка.СчетКт = СчетУчета;
		Проводка.СубконтоКт.Облигации = ЭтотОбъект.ЦеннаяБумага;
		
		Если ВалютныйУчет Тогда
			Проводка.ВалютнаяСуммаКт = Стоимость;
			Проводка.ВалютаКт = ВалютаНоминала;
		КонецЕсли;
		
		Если ПереоценкаВВалютеУчета <> 0 Тогда // СчетУчета <> СчетУчетаПереоценки - убрал проверку т.к. есть клиент с такими настройками - СМАО
			
			//Дт СчетРасходы Кт СчетУчетаПереоценки = Переоценка
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ПереоценкаВВалютеУчета, "Переоценка в расход");
			
			Проводка.СчетДт = СчетРасходов;
			Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходов;
			Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
			
			Проводка.СчетКт = СчетУчетаПереоценки;
			Проводка.СубконтоКт.Облигации = ЭтотОбъект.ЦеннаяБумага;
				
			Если ВалютныйУчет Тогда
				Проводка.ВалютнаяСуммаКт = Переоценка;
				Проводка.ВалютаКт = ВалютаНоминала;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;	
	
	Если НастройкиПоВидуУчета.СписыватьКупленныйКупонПриЧастичномПогашенииОблигации И (СтоимостьКупона <> 0) Тогда
	
		//Дт СчетРасходы Кт СчетУчетаКупон = СтоимостьКупона
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтоимостьКупонаВВалютеУчета, "Списание себестоимости купона");
		
		Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходовПоследнееПогашение;
		Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		
		Проводка.СчетКт = СчетУчетаКупон;
		Проводка.СубконтоКт.Облигации = ЭтотОбъект.ЦеннаяБумага;
		
		Если ВалютныйУчет Тогда
			Проводка.ВалютнаяСуммаКт = СтоимостьКупона;
			Проводка.ВалютаКт = ВалютаНоминала;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерииПолноеПогашение(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности = Неопределено, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь, ТолькоПерекурсовать = Ложь)

	ЭтотОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ЦеннаяБумага, Рынок, ВалютаОплаты, Сумма, Количество");
	
	ВалютаОплаты = ЭтотОбъект.ВалютаОплаты;
	ЦеннаяБумага = ЭтотОбъект.ЦеннаяБумага;
	
	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, ЭтотОбъект.Рынок, ЭтотОбъект.ЦеннаяБумага);
	
	ВидСубконтоУчетаЦеннойБумаги = БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(ЭтотОбъект.Рынок);	
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);		
		
	НастройкиУчетаПогашения = БухгалтерскийУчет.ОпределитьНастройкуУчетаАктивов(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		Перечисления.ВидыУчета[УчетныйРегистр],
		"ВариантОтраженияДебиторскойЗадолженностиПриПолномПогашении");
		
	СчетДоходов  = ПланыСчетов.Основной.ПрочиеДоходы;	
	СчетРасходов = ПланыСчетов.Основной.ПрочиеРасходы;
		
	ИспользоватьСчетПродаж = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		Дата,
		Организация, 
		СчетДоверительногоУправления,
		"ИспользоватьСчетПродаж");
		
	Если ИспользоватьСчетПродаж Тогда
		СчетДоходов  = ПланыСчетов.Основной.Выручка;
		СчетРасходов = ПланыСчетов.Основной.СебестоимостьПродажи;
	КонецЕсли;	
		
	ВариантПогашения = ?(НастройкиУчетаПогашения.Свойство(УчетныйАктив.ИмяПредопределенныхДанных),
		НастройкиУчетаПогашения[УчетныйАктив.ИмяПредопределенныхДанных],
		Неопределено);

	ОбращаетсяНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦеннойБумагиНаОРЦБ(Дата, ЭтотОбъект.ЦеннаяБумага, УчетныйРегистр);
	
	ВалютаНоминала = ЦеннаяБумага.ВалютаНоминала;
	ВалютныйУчет = ВалютаНоминала <> Организация.ВалютаУчета;
	
	//читаем движения партий
	// В налоговом учете перекурсовок нет, для проводок используем суммы списания по партиям
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
		|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА &ВидУчета = &ВидУчетаНалоговый
		|			ТОГДА ЛОЖЬ
		|		КОГДА БухПартииЦенныхБумаг.Стоимость = 0
		|				И БухПартииЦенныхБумаг.Переоценка = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Перекурсовка,
		|	СУММА(БухПартииЦенныхБумаг.ИндексацияНоминала) КАК ИндексацияНоминала,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И БухПартииЦенныхБумаг.Количество = 0
		|				И (БухПартииЦенныхБумаг.Переоценка <> 0
		|					ИЛИ БухПартииЦенныхБумаг.Стоимость <> 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Дооценка
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА &ВидУчета = &ВидУчетаНалоговый
		|			ТОГДА ЛОЖЬ
		|		КОГДА БухПартииЦенныхБумаг.Стоимость = 0
		|				И БухПартииЦенныхБумаг.Переоценка = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				И БухПартииЦенныхБумаг.Количество = 0
		|				И (БухПартииЦенныхБумаг.Переоценка <> 0
		|					ИЛИ БухПартииЦенныхБумаг.Стоимость <> 0)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";

	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("ВидУчетаНалоговый", Перечисления.ВидыУчета.НалоговыйУчет);

	Выборка = Запрос.Выполнить().Выбрать();

	СтруктураОбъекта = Новый Структура("Ссылка, Дата, Движения", ДокументСсылка, Дата, Движения);
	
	Если Выборка.Количество()>0 Тогда
		Пока Выборка.Следующий() Цикл
			Если Выборка.Перекурсовка Тогда
				ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, Рынок,"
					+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета",
					ЦеннаяБумага, ЭтотОбъект.Рынок,
					Выборка.СтоимостьВВалютеУчета, 0, Выборка.ПереоценкаВВалютеУчета, 0);
					
				СчетаУчета = Новый Структура;
				СчетаУчета.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчета);
				
				СчетаУчетаПереоценки = Новый Структура;
				СчетаУчетаПереоценки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчетаПереоценки);
				
				АналитикаПерекурсовки = Новый Структура;
				АналитикаПерекурсовки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.АналитикаПерекурсовки);
				
				БухгалтерскийУчет.ДвижениеПерекурсовки(СтруктураОбъекта, УчетныйРегистр, ПараметрыПерекурсовки, АналитикаПерекурсовки,  СчетаУчета, СчетаУчетаПереоценки, ОбращаетсяНаОРЦБ, Отказ);		
			ИначеЕсли Выборка.Дооценка Тогда
				
				Если Выборка.СтоимостьВВалютеУчета > 0 Тогда
					// доначислим переоценку перед продажей
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Выборка.СтоимостьВВалютеУчета, "Переоценка ценной бумаги");
					
					Проводка.СчетДт = НастройкиУчета.СчетУчета;
					Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
					
					Если ВалютныйУчет Тогда
						Проводка.ВалютнаяСуммаДт = Выборка.Стоимость;
						Проводка.ВалютаДт = ВалютаНоминала;
					КонецЕсли;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
					Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
					Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
					Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
					
				ИначеЕсли Выборка.СтоимостьВВалютеУчета < 0 Тогда
					// доначислим переоценку перед продажей
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, -Выборка.СтоимостьВВалютеУчета, "Переоценка ценной бумаги");
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
					
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
					Проводка.СубконтоДт.ЦенныеБумаги         = ЦеннаяБумага;
					Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
					
					
					Проводка.СчетКт = НастройкиУчета.СчетУчета;
					Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
					
					Если ВалютныйУчет Тогда
						Проводка.ВалютнаяСуммаКт = -Выборка.Стоимость;
						Проводка.ВалютаКт = ВалютаНоминала;
					КонецЕсли;
					
				КонецЕсли;
				
				Если Выборка.ПереоценкаВВалютеУчета > 0 Тогда
					// доначислим переоценку перед продажей
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, Выборка.ПереоценкаВВалютеУчета, "Переоценка ценной бумаги");
					
					Проводка.СчетДт = НастройкиУчета.СчетУчетаПереоценки;
					Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
					
					Если ВалютныйУчет Тогда
						Проводка.ВалютнаяСуммаДт = Выборка.Переоценка;
						Проводка.ВалютаДт = ВалютаНоминала;
					КонецЕсли;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
					Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
					Проводка.СубконтоКт.ЦенныеБумаги         = ЦеннаяБумага;
					Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
					
				ИначеЕсли Выборка.ПереоценкаВВалютеУчета < 0 Тогда
					// доначислим переоценку перед продажей
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, -Выборка.ПереоценкаВВалютеУчета, "Переоценка ценной бумаги");
					
					Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
					
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
					Проводка.СубконтоДт.ЦенныеБумаги         = ЦеннаяБумага;
					Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
					
					
					Проводка.СчетКт = НастройкиУчета.СчетУчетаПереоценки;
					Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
					
					Если ВалютныйУчет Тогда
						Проводка.ВалютнаяСуммаКт = -Выборка.Переоценка;
						Проводка.ВалютаКт = ВалютаНоминала;
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				Стоимость 				= Выборка.Стоимость;
				СтоимостьВВалютеУчета  	= Выборка.СтоимостьВВалютеУчета;
				Переоценка 				= Выборка.Переоценка;
				ПереоценкаВВалютеУчета 	= Выборка.ПереоценкаВВалютеУчета;
				ИндексацияНоминала	 	= Выборка.ИндексацияНоминала;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ТолькоПерекурсовать Тогда
		Возврат;
	КонецЕсли;
	
	Если ВалютаОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ВалютаУчета") Тогда
		РасчетыСДебиторамиИКредиторами = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВРублях;
	Иначе
		РасчетыСДебиторамиИКредиторами = ПланыСчетов.Основной.РасчетыСДебиторамиИКредиторамиВВалюте;
	КонецЕсли;
	
	СчетУчета = НастройкиУчета.СчетУчета;
		
	СчетУчетаПереоценки = НастройкиУчета.СчетУчетаПереоценки;
		
	АналитикаДоходов = НастройкиУчета.АналитикаДоходов;		
		
	//Дт Счет7651 Кт СчетДоходы Сумма = ЭтотОбъект.СуммаКупона
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.Сумма, ВалютаОплаты, Организация, Дата, Отказ), "Доход от погашения облигации");
	
	Проводка.СчетДт = РасчетыСДебиторамиИКредиторами;
	Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.ЦеннаяБумага.Эмитент.ЮрФизЛицо;
	
	Если  РасчетыСДебиторамиИКредиторами.Валютный Тогда
		Проводка.ВалютнаяСуммаДт = ЭтотОбъект.Сумма;
		Проводка.ВалютаДт = ВалютаОплаты;
	КонецЕсли;
	
	Проводка.СчетКт = СчетДоходов;
	Проводка.СубконтоКт.ПрочиеДоходыИРасходы = АналитикаДоходов;
	Проводка.СубконтоКт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
	Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
	
	//Дт СчетРасходы Кт СчетУчета Сумма = Стоимость
	Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтоимостьВВалютеУчета, "Себестоимость в расход");
	
	Проводка.СчетДт = СчетРасходов;
	Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходов;
	Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
	Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
	
	Проводка.СчетКт = СчетУчета;
	Проводка.СубконтоКт.Облигации = ЭтотОбъект.ЦеннаяБумага;
	
	Проводка.КоличествоКт = ЭтотОбъект.Количество;
	Если ВариантПогашения = Перечисления.ВариантыОтраженияДебиторскойЗадолженностиПриПолномПогашенииОблигаций.НаМоментПогашения И ЭтоПроведениеНачисления Тогда
	    Проводка.КоличествоКт = 0;
	КонецЕсли;
	
	Если ВалютныйУчет Тогда
		Проводка.ВалютнаяСуммаКт 	= Стоимость;
		Проводка.ВалютаКт 			= ВалютаНоминала;
	КонецЕсли;
	
	Если СчетУчета <> СчетУчетаПереоценки И Переоценка <> 0 Тогда
		//Дт СчетРасходы Кт СчетУчетаПереоценки = Переоценка
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ПереоценкаВВалютеУчета, "Переоценка в расход");
		
		Проводка.СчетДт = СчетРасходов;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = АналитикаДоходов;
		Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		
		Проводка.СчетКт = СчетУчетаПереоценки;
		Проводка.СубконтоКт.Облигации = ЭтотОбъект.ЦеннаяБумага;
		
		Если ВалютныйУчет Тогда
			Проводка.ВалютнаяСуммаКт 	= Переоценка;
			Проводка.ВалютаКт 			= ВалютаНоминала;
		КонецЕсли;
	КонецЕсли;
	
	Если ИндексацияНоминала <> 0 Тогда
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ИндексацияНоминала, "Индексация номинала");
		
		// дебет
		Проводка.СчетДт = СчетРасходов;
		Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовИндексацииНоминала;
		Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
		Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		
		// кредит
		Проводка.СчетКт = НастройкиУчета.СчетУчетаИндексацииНоминала;
		Проводка.СубконтоКт.Облигации = ЭтотОбъект.ЦеннаяБумага;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроведениеПоРегиструБухгалтерииПогашениеКупона(ДокументСсылка, Движения, Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности = Неопределено, УчетныйРегистр, Отказ, ЭтоПроведениеНачисления = Ложь)

	ЭтотОбъект = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ЦеннаяБумага, Рынок, ВалютаОплаты, Сумма, СуммаКупона, Количество");
	
	ВалютаОплаты = ЭтотОбъект.ВалютаОплаты;

	УчетныйАктив = БухгалтерскийУчет.ОпределитьУчетныйАктив(Дата, ЭтотОбъект.Рынок, ЭтотОбъект.ЦеннаяБумага, Истина);
	
	НастройкиУчета = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
		Дата,
		Организация,
		СчетДоверительногоУправления,
		УчетныйАктив,
		УчетныйРегистр);		
		
	СчетДоходов  = ПланыСчетов.Основной.ПрочиеДоходы;	
	СчетРасходов = ПланыСчетов.Основной.ПрочиеРасходы;
		
	ИспользоватьСчетПродаж = БухгалтерскийУчет.ОпределитьНастройкуУчета(
		Дата,
		Организация, 
		СчетДоверительногоУправления,
		"ИспользоватьСчетПродаж");		
		
	Если ИспользоватьСчетПродаж Тогда
		СчетДоходов  = ПланыСчетов.Основной.Выручка;
		СчетРасходов = ПланыСчетов.Основной.СебестоимостьПродажи;
	КонецЕсли;		
		
	ОбращаетсяНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииЦеннойБумагиНаОРЦБ(Дата, ЭтотОбъект.ЦеннаяБумага, УчетныйРегистр);
	
	ВалютаНоминала = ЭтотОбъект.ЦеннаяБумага.ВалютаНоминала;
	ВалютныйУчет  = ВалютаНоминала <> Организация.ВалютаУчета;
	
	//читаем движения партий
	// В налоговом учете перекурсовок нет, для проводок используем суммы списания по партиям
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупона) КАК СтоимостьКупона,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупона) КАК ПереоценкаКупона,
		|	СУММА(БухПартииЦенныхБумаг.СтоимостьКупонаВВалютеУчета) КАК СтоимостьКупонаВВалютеУчета,
		|	СУММА(БухПартииЦенныхБумаг.ПереоценкаКупонаВВалютеУчета) КАК ПереоценкаКупонаВВалютеУчета,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.Количество = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона <> 0
		|				И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ДооценкаКупона,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Перекурсовка
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
		|ГДЕ
		|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
		|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.Количество = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона <> 0
		|				И БухПартииЦенныхБумаг.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумаг.СтоимостьКупона = 0
		|				И БухПартииЦенныхБумаг.ПереоценкаКупона = 0
		|				И БухПартииЦенныхБумаг.ИндексацияНоминала = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ";

	Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидУчета", Перечисления.ВидыУчета[УчетныйРегистр]);
	Запрос.УстановитьПараметр("ВидУчетаНалоговый", Перечисления.ВидыУчета.НалоговыйУчет);

	Выборка = Запрос.Выполнить().Выбрать();

	СтруктураОбъекта = Новый Структура("Ссылка, Дата, Движения", ДокументСсылка, Дата, Движения);
	
	СтоимостьКупона  				= 0;
	СтоимостьКупонаВВалютеУчета 	= 0;
	ПереоценкаКупона 				= 0;
	ПереоценкаКупонаВВалютеУчета 	= 0;	
	ДооценкаКупона = 0;
	ДооценкаКупонаВВалютеУчета = 0;
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			Если Выборка.Перекурсовка Тогда
				ПараметрыПерекурсовки = Новый Структура("ЦеннаяБумага, Рынок,"
					+ "СтоимостьВВалютеУчета, СтоимостьКупонаВВалютеУчета, ПереоценкаВВалютеУчета, ПереоценкаКупонаВВалютеУчета",
					ЭтотОбъект.ЦеннаяБумага, ЭтотОбъект.Рынок,
					0, Выборка.СтоимостьКупонаВВалютеУчета, 0, Выборка.ПереоценкаКупонаВВалютеУчета);
					
				СчетаУчета = Новый Структура;
				СчетаУчета.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчета);
				
				СчетаУчетаПереоценки = Новый Структура;
				СчетаУчетаПереоценки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.СчетУчетаПереоценки);
				
				АналитикаПерекурсовки = Новый Структура;
				АналитикаПерекурсовки.Вставить(УчетныйАктив.ИмяПредопределенныхДанных, НастройкиУчета.АналитикаПерекурсовки);
				
				БухгалтерскийУчет.ДвижениеПерекурсовки(СтруктураОбъекта, УчетныйРегистр, ПараметрыПерекурсовки, АналитикаПерекурсовки,  СчетаУчета, СчетаУчетаПереоценки, ОбращаетсяНаОРЦБ, Отказ);		
								
			ИначеЕсли Выборка.ДооценкаКупона  Тогда
				
				ДооценкаКупона			 	= Выборка.ПереоценкаКупона;
				ДооценкаКупонаВВалютеУчета	= Выборка.ПереоценкаКупонаВВалютеУчета;
				
			Иначе
				СтоимостьКупона  				= Выборка.СтоимостьКупона;
				СтоимостьКупонаВВалютеУчета 	= Выборка.СтоимостьКупонаВВалютеУчета;
				ПереоценкаКупона 				= Выборка.ПереоценкаКупона;
				ПереоценкаКупонаВВалютеУчета 	= Выборка.ПереоценкаКупонаВВалютеУчета;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ВалютныйУчет Тогда
		СчетПогашенияКупона = ПланыСчетов.Основной.ПогашениеКупона;
	Иначе
		СчетПогашенияКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации;
	КонецЕсли;
	
	СчетУчета = НастройкиУчета.СчетУчета;
		
	СчетУчетаПереоценки = НастройкиУчета.СчетУчетаПереоценки;
		
	ОтражатьНаПереоценкеПолнуюСумму = НастройкиУчета.ОтражатьНаПереоценкеПолнуюСумму;		
	
	Если ДооценкаКупонаВВалютеУчета <> 0 Тогда
	
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ДооценкаКупонаВВалютеУчета, "Переоценка купона ценной бумаги");
		
		Проводка.СчетДт = СчетУчетаПереоценки;
		Проводка.СубконтоДт.Облигации = ЭтотОбъект.ЦеннаяБумага;
		
		Если ВалютныйУчет Тогда
			Проводка.ВалютнаяСуммаДт = Выборка.ПереоценкаКупонаДоначислено;
			Проводка.ВалютаДт = ВалютаНоминала;
		КонецЕсли;
		
		// кредит
		Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
		Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
		Проводка.СубконтоКт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
		Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
	
	КонецЕсли;
	
	
	Если ВалютаНоминала = Организация.ВалютаУчета Тогда // предполагаем, что рублевые облигации оплачиваются в рублях т.к. обратных случаев не было
		СуммаЗадолженностиПоКупону				= ЭтотОбъект.СуммаКупона;
		СуммаЗадолженностиПоКупонуВВалютеУчета	= ЭтотОбъект.СуммаКупона;
	ИначеЕсли ВалютаОплаты = Организация.ВалютаУчета Тогда // погашение купона по валютной бумаге причем сумма в рублях... маразм, блин!
		СуммаЗадолженностиПоКупону = ЭтотОбъект.СуммаКупона;
		СуммаЗадолженностиПоКупонуВВалютеУчета	= ЭтотОбъект.СуммаКупона;
	Иначе // валютная облигация, валютная оплата
		СуммаЗадолженностиПоКупону				= ЭтотОбъект.СуммаКупона;
		СуммаЗадолженностиПоКупонуВВалютеУчета	= РаботаСВалютами.ПолучитьСуммуВВалютеУчета(ЭтотОбъект.СуммаКупона, ВалютаОплаты, Организация, Дата, Отказ);
	КонецЕсли;
	
	ОтражатьВДоходеТолькоРазницу = НастройкиУчета.ПриПогашенииВДоходеОтражатьТолькоРазницу;
	
	Если СуммаЗадолженностиПоКупону <> 0  Тогда
		Если НЕ ОтражатьВДоходеТолькоРазницу Тогда
			
			//Дт Счет7654 Кт СчетДоходы Сумма = ЭтотОбъект.СуммаКупона
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаЗадолженностиПоКупонуВВалютеУчета, "Доход от погашения купона");
			
			Проводка.СчетДт = СчетПогашенияКупона;
			Проводка.СубконтоДт.Облигации = ЭтотОбъект.ЦеннаяБумага;
			
			Если ВалютныйУчет Тогда
				Если ВалютаОплаты <> Организация.ВалютаУчета Тогда
					Проводка.ВалютнаяСуммаДт = РаботаСВалютами.ПересчетСуммыВВалюте(СуммаЗадолженностиПоКупону, ВалютаНоминала, Дата, ВалютаОплаты, Дата, Отказ);
				Иначе
					Проводка.ВалютнаяСуммаДт = СуммаЗадолженностиПоКупону;
				КонецЕсли;	
				
				Проводка.ВалютаДт = ВалютаОплаты;
			КонецЕсли;
			
			Если СчетПогашенияКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации Тогда
				Проводка.СубконтоДт.ОснованиеРасчетов = ДокументСсылка; 
			КонецЕсли;				
			
			Проводка.СчетКт = СчетДоходов;
			Если ОтражатьНаПереоценкеПолнуюСумму Тогда 
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходов;
			Иначе	
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовПоследнееПогашение;
			КонецЕсли;	
			Проводка.СубконтоКт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
			Проводка.СубконтоКт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
		КонецЕсли;
	КонецЕсли;
	
	Если ПереоценкаКупонаВВалютеУчета <> 0 И СчетУчета <> СчетУчетаПереоценки Тогда
		
		//Дт СчетРасходы Кт СчетУчетаПереоценки = ПереоценкаКупона
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ПереоценкаКупонаВВалютеУчета, "Переоценка купона в расход");
		
		Если  НЕ ОтражатьВДоходеТолькоРазницу Тогда 
			
			Проводка.СчетДт = СчетРасходов;
			
			Если УчетныйРегистр = "НалоговыйУчет" Тогда
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовОтПереоценки;
			Иначе
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовПоследнееПогашение;
			КонецЕсли;
			
			Проводка.СубконтоДт.ЦенныеБумаги     = ЭтотОбъект.ЦеннаяБумага;
			Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
		Иначе
			Проводка.СчетДт = СчетПогашенияКупона;
			Проводка.СубконтоДт.Облигации = ЭтотОбъект.ЦеннаяБумага;
			
			Если ВалютныйУчет Тогда
				Проводка.ВалютнаяСуммаДт = ПереоценкаКупона;
				Проводка.ВалютаДт = ВалютаНоминала;
			КонецЕсли;			
			
			Если СчетПогашенияКупона = ПланыСчетов.Основной.ПогашениеКупонаЕврооблигации Тогда
				Проводка.СубконтоДт.ОснованиеРасчетов = ДокументСсылка; 
			КонецЕсли;			
			
		КонецЕсли;
		
		Проводка.СчетКт = СчетУчетаПереоценки;
		Проводка.СубконтоКт.Облигации = ЭтотОбъект.ЦеннаяБумага;
		
		Если ВалютныйУчет Тогда
			Проводка.ВалютнаяСуммаКт = ПереоценкаКупона;
			Проводка.ВалютаКт = ВалютаНоминала;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ОтражатьНаПереоценкеПолнуюСумму Тогда
		Если СтоимостьКупонаВВалютеУчета  <> 0 Тогда 
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СтоимостьКупонаВВалютеУчета, "Купон в расход");
			
			Если  НЕ ОтражатьВДоходеТолькоРазницу Тогда
				Проводка.СчетДт = СчетРасходов;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчета.АналитикаДоходовПоследнееПогашение;
				Проводка.СубконтоДт.ЦенныеБумаги         = ЭтотОбъект.ЦеннаяБумага;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ     = ОбращаетсяНаОРЦБ;
			Иначе
				Проводка.СчетДт = СчетПогашенияКупона;
				Проводка.СубконтоДт.Облигации = ЭтотОбъект.ЦеннаяБумага;
				
				Если ВалютныйУчет Тогда
					Проводка.ВалютнаяСуммаДт = СтоимостьКупона;
					Проводка.ВалютаДт = ВалютаНоминала;
				КонецЕсли;							
			КонецЕсли;
			
			Проводка.СчетКт = СчетУчета;
			Проводка.СубконтоКт.Облигации = ЭтотОбъект.ЦеннаяБумага;
			
			Если ВалютныйУчет Тогда
				Проводка.ВалютнаяСуммаКт = СтоимостьКупона;
				Проводка.ВалютаКт = ВалютаНоминала;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
